In [167]:
import pandas as pd
df=pd.read_csv('data/score.csv')
df.set_index('지원번호', inplace=True)
df[:3]

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85      Python
2번    정대만  북산고  184  40  35   50  55  25        Java
3번    송태섭  북산고  168  80  75   70  80  75  Javascript

In [168]:
df.groupby('학교').get_group('북산고')

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85      Python
2번    정대만  북산고  184  40  35   50  55  25        Java
3번    송태섭  북산고  168  80  75   70  80  75  Javascript
4번    서태웅  북산고  187  40  60   70  75  80         NaN
5번    강백호  북산고  188  15  20   10  35  10         NaN

In [169]:
df2=df.groupby('학교').size().to_frame('학생수')
df2

     학생수
학교
능남고    3
북산고    5

In [170]:
df2.loc['능남고']

학생수    3
Name: 능남고, dtype: int64

In [171]:
df2=df.groupby('학교')['키'].mean().to_frame('키평균')
df2.sort_values('키평균', ascending=False)

            키평균
학교
능남고  193.333333
북산고  184.800000

In [172]:
df2=df.groupby('학교')[['국어', '영어', '수학']].mean()
df2.columns=['국어평균', '영어평균', '수학평균']
df2

          국어평균       영어평균       수학평균
학교
능남고  78.333333  83.333333  76.666667
북산고  53.000000  55.000000  60.000000

In [173]:
df['학년']=[3,3,3,1,1,3,2,2]
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python   3
2번    정대만  북산고  184   40   35   50  55  25        Java   3
3번    송태섭  북산고  168   80   75   70  80  75  Javascript   3
4번    서태웅  북산고  187   40   60   70  75  80         NaN   1
5번    강백호  북산고  188   15   20   10  35  10         NaN   1
6번    변덕규  능남고  202   80  100   95  85  80           C   3
7번    황태산  능남고  188   55   65   45  40  35      PYTHON   2
8번    윤대협  능남고  190  100   85   90  95  95          C#   2

In [174]:
df2=df.groupby('학년')[['키']].mean()
df2.columns=['키평균']
df2

       키평균
학년
1   187.50
2   189.00
3   187.75

In [175]:
df2 = df.groupby(['학교', '학년'])['키'].mean()
df2

학교   학년
능남고  2     189.0
     3     202.0
북산고  1     187.5
     3     183.0
Name: 키, dtype: float64

In [176]:
df2.loc[('능남고', 3)]

np.float64(202.0)

In [177]:
df2 = df.groupby('이름')[['국어', '영어',]].mean()
df2.sort_values(['국어', '영어'], ascending=[False, True])

        국어     영어
이름
윤대협  100.0   85.0
채치수   90.0   85.0
송태섭   80.0   75.0
변덕규   80.0  100.0
황태산   55.0   65.0
정대만   40.0   35.0
서태웅   40.0   60.0
강백호   15.0   20.0

In [178]:
df2=df.groupby('학교').count()
df2[['이름','SW특기']]

     이름  SW특기
학교
능남고   3     3
북산고   5     3

In [179]:
df.loc['4번', 'SW특기'] = 'java'
df.loc['5번', 'SW특기'] = 'python'
df['SW특기']=df['SW특기'].str.capitalize()
df['SW특기'].unique()

array(['Python', 'Java', 'Javascript', 'C', 'C#'], dtype=object)

In [180]:
df.groupby('SW특기').size()

SW특기
C             1
C#            1
Java          2
Javascript    1
Python        3
dtype: int64

In [181]:
df2=df['SW특기'].value_counts(normalize=True).to_frame()
df2['퍼센트'] = df2['proportion'] * 100
df2

            proportion   퍼센트
SW특기
Python           0.375  37.5
Java             0.250  25.0
Javascript       0.125  12.5
C                0.125  12.5
C#               0.125  12.5

In [182]:
df.groupby('학교')['SW특기'].unique()

학교
능남고               [C, Python, C#]
북산고    [Python, Java, Javascript]
Name: SW특기, dtype: object

In [183]:
df2=df.groupby(['학교', 'SW특기']).size().to_frame('인원수')
df2.to_excel('data/학교별SW특기인원수.xlsx')